Tekla.Structures.Plugins.DirectManipulation.Core.Features.PluginManipulationFeatureBase
The Tekla.Structures.Plugins.DirectManipulation.Core.Features.PluginManipulationFeatureBase class provides the base class for manipulation features for plugins.
Tekla.Structures.Plugins.DirectManipulation.Internal.Features.ComponentManipulationFeatureBase

Tekla.Structures.Plugins.DirectManipulation.Core.Features.PluginManipulationFeatureBase.#ctor(System.String,System.Boolean)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Core.Features.PluginManipulationFeatureBase class.
name: The name of the plugin.
useFeatureContextualToolBar:
The System.Boolean value to indicate whether the feature level contextual toolbar should be used.